GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
/**************************************************************************************************** 
 * @file     FM33LR0XX.h
 *
 * @brief    CMSIS CORTEX-M0 Peripheral Access Layer Header File for
 *           FM33LR0XX from Keil.
 *
 * @version  V1.0.6
 * @date     08 August 2025
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33LR0XX.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *
 *           THIS SOFTWARE IS PROVIDED “AS IS”. NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 *******************************************************************************************************/


/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33LR0XX
  * @{
  */

#ifndef FM33LR0XX_H
#define FM33LR0XX_H

#ifdef __cplusplus
extern "C" {
#endif

#define __RCHF_INITIAL_CLOCK        (8000000)        /* Value of the Internal RC HIGH oscillator in Hz */
#define __RCLP_CLOCK                (32000)          /* Value of the Internal RC LOW oscillator in Hz */
#define __XTHF_CLOCK                (8000000)        /* Value of the EXTERNAL oscillator in Hz */
#define __XTLF_CLOCK                (32768)          /* Value of the EXTERNAL oscillator in Hz */


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {

/* ---------------------  CORTEX-M0 Processor Exceptions Numbers  --------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NMI_IRQn           			= -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */

  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  FM33LR0XX Specific Interrupt Numbers  -------------------- */
  WDT_IRQn                      =   0,              /*!<   0  WDT interrupt                                                    */
  SVD_IRQn                      =   1,              /*!<   1  SVD interrupt                                                    */
  MUX0_IRQn                     =   3,              /*!<   3  MUX0 interrupt                                                   */
  ADC_IRQn                      =   5,              /*!<   5  ADC interrupt                                                    */
  MUX1_IRQn                     =   7,              /*!<   7  MUX1 interrupt                                                   */
  MUX2_IRQn                     =   8,              /*!<   8  MUX2 interrupt                                                   */
  MUX3_IRQn                     =   9,              /*!<   9  MUX3 interrupt                                                   */
  MUX4_IRQn                     =  10,              /*!<  10  MUX4 interrupt                                                   */
  MUX5_IRQn                     =  11,              /*!<  11  MUX5 interrupt                                                   */
  MUX6_IRQn                     =  12,              /*!<  12  MUX6 interrupt                                                   */
  MUX7_IRQn                     =  13,              /*!<  13  MUX7 interrupt                                                   */
  MUX8_IRQn                     =  14,              /*!<  14  MUX8 interrupt                                                   */
  I2CMX_IRQn                    =  15,              /*!<  15  I2CMx interrupt                                                  */
  GPTIM_IRQn                    =  17,              /*!<  17  GPTIM interrupt                                                  */
  MUX9_IRQn                     =  18,              /*!<  18  MUX9 interrupt                                                   */
  LPTIM_IRQn                    =  20,              /*!<  20  LPTIM interrupt                                                  */
  DMA_IRQn                      =  21,              /*!<  21  DMA interrupt                                                    */
  WKUPX_IRQn                    =  22,              /*!<  22  WKUPx interrupt                                                  */
  MUX10_IRQn                    =  23,              /*!<  23  MUX10 interrupt                                                  */
  BSTIM_IRQn                    =  24,              /*!<  24  BSTIM interrupt                                                  */
  COMPX_IRQn                    =  25,              /*!<  25  COMPx interrupt                                                  */
  MUX11_IRQn                    =  26,              /*!<  26  MUX11 interrupt                                                  */
  MUX12_IRQn                    =  27,              /*!<  27  MUX12 interrupt                                                  */
  ATIM_IRQn                     =  28,              /*!<  28  ATIM interrupt                                                   */
  MUX13_IRQn                    =  29,              /*!<  29  MUX13 interrupt                                                  */
  GPIO_IRQn                     =  30,              /*!<  30  EXTI interrupt                                                   */
  ECCC_RAMP_FDET_IRQn           =  31               /*!<  31  ECCC_RAMP_FDET interrupt                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the CORTEX-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< CORTEX-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __VTOR_PRESENT                 1            /*!< VTOR present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                            /*!< Cortex-M0 processor and core peripherals */
#include "system_fm33lr0xx.h"                        /*!< FM33LR0XX System */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */

/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief ADC module information (ADC)
  */

