GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
typedef struct {                                    /*!< ADC Structure                                                         */
  __IO uint32_t  ISR;                               /*!< ADC_ISR Register                                                      */
  __IO uint32_t  IER;                               /*!< ADC_IER Register                                                      */
  __IO uint32_t  CR1;                               /*!< ADC_CR1 Register                                                      */
  __IO uint32_t  CR2;                               /*!< ADC_CR2 Register                                                      */
  __IO uint32_t  CALCR;                             /*!< ADC_CALCR Register                                                    */
  __IO uint32_t  CFGR1;                             /*!< ADC_CFGR1 Register                                                    */
  __IO uint32_t  CFGR2;                             /*!< ADC_CFGR2 Register                                                    */
  __IO uint32_t  SMTR;                              /*!< ADC_SMTR Register                                                     */
  __IO uint32_t  CHER;                              /*!< ADC_CHER Register                                                     */
  __I  uint32_t  RESERVED;
  __IO uint32_t  DR;                                /*!< ADC_DR Register                                                       */
} ADC_Type;



/* ================================================================================ */
/* ================                      ATIM                      ================ */
/* ================================================================================ */


/**
  * @brief ATIM module information (ATIM)
  */

typedef struct {                                    /*!< ATIM Structure                                                        */
  __IO uint32_t  CR1;                               /*!< ATIM_CR1 Register                                                     */
  __IO uint32_t  CR2;                               /*!< ATIM_CR2 Register                                                     */
  __IO uint32_t  SMCR;                              /*!< ATIM_SMCR Register                                                    */
  __IO uint32_t  DIER;                              /*!< ATIM_DIER Register                                                    */
  __IO uint32_t  ISR;                               /*!< ATIM_ISR Register                                                     */
  __IO uint32_t  EGR;                               /*!< ATIM_EGR Register                                                     */
  __IO uint32_t  CCMR1;                             /*!< ATIM_CCMR1 Register                                                   */
  __IO uint32_t  CCMR2;                             /*!< ATIM_CCMR2 Register                                                   */
  __IO uint32_t  CCER;                              /*!< ATIM_CCER Register                                                    */
  __IO uint32_t  CNT;                               /*!< ATIM_CNT Register                                                     */
  __IO uint32_t  PSC;                               /*!< ATIM_PSC Register                                                     */
  __IO uint32_t  ARR;                               /*!< ATIM_ARR Register                                                     */
  __IO uint32_t  RCR;                               /*!< ATIM_RCR Register                                                     */
  __IO uint32_t  CCR1;                              /*!< ATIM_CCR1 Register                                                    */
  __IO uint32_t  CCR2;                              /*!< ATIM_CCR2 Register                                                    */
  __IO uint32_t  CCR3;                              /*!< ATIM_CCR3 Register                                                    */
  __IO uint32_t  CCR4;                              /*!< ATIM_CCR4 Register                                                    */
  __IO uint32_t  BDTR;                              /*!< ATIM_BDTR Register                                                    */
  __IO uint32_t  CCMR3;                             /*!< ATIM_CCMR3 Register                                                   */
  __IO uint32_t  CCR5;                              /*!< ATIM_CCR5 Register                                                    */
  __IO uint32_t  CCR6;                              /*!< ATIM_CCR6 Register                                                    */
  __IO uint32_t  ECR;                               /*!< ATIM_ECR Register                                                     */
  __IO uint32_t  TISEL;                             /*!< ATIM_TISEL Register                                                   */
  __IO uint32_t  AFR;                               /*!< ATIM_AFR Register                                                     */
  __IO uint32_t  BRKISR;                            /*!< ATIM_BRKISR Register                                                  */
  __I  uint32_t  RESERVED[37];
} ATIM_Type;


/* ================================================================================ */
/* ================                     BSTIM16                    ================ */
/* ================================================================================ */


/**
  * @brief BSTIM16 module information (BSTIM16)
  */

typedef struct {                                    /*!< BSTIM16 Structure                                                     */
  __IO uint32_t  CR1;                               /*!< BSTIM16_CR1 Register                                                  */
  __IO uint32_t  CR2;                               /*!< BSTIM16_CR2 Register                                                  */
  __I  uint32_t  RESERVED;
  __IO uint32_t  IER;                               /*!< BSTIM16_IER Register                                                  */
  __IO uint32_t  ISR;                               /*!< BSTIM16_ISR Register                                                  */
  __IO uint32_t  EGR;                               /*!< BSTIM16_EGR Register                                                  */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  CNT;                               /*!< BSTIM16_CNT Register                                                  */
  __IO uint32_t  PSC;                               /*!< BSTIM16_PSC Register                                                  */
  __IO uint32_t  ARR;                               /*!< BSTIM16_ARR Register                                                  */
} BSTIM16_Type;


/* ================================================================================ */
/* ================                       CMU                      ================ */
/* ================================================================================ */


/**
  * @brief CMU module information (CMU)
  */

