GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
typedef struct {                                    /*!< CMU Structure                                                         */
  __IO uint32_t  SYSCLKCR;                          /*!< CMU_SYSCLKCR Register                                                 */
  __IO uint32_t  RCHFCR;                            /*!< CMU_RCHFCR Register                                                   */
  __IO uint32_t  RCHFTR;                            /*!< CMU_RCHFTR Register                                                   */
  __IO uint32_t  PLLCR;                             /*!< CMU_PLLCR Register                                                    */
  __I  uint32_t  RESERVED;
  __IO uint32_t  RCLPTR;                            /*!< CMU_RCLPTR Register                                                   */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  XTHFCR;                            /*!< CMU_XTHFCR Register                                                   */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  IER;                               /*!< CMU_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< CMU_ISR Register                                                      */
  __IO uint32_t  PCLKCR1;                           /*!< CMU_PCLKCR1 Register                                                  */
  __IO uint32_t  PCLKCR2;                           /*!< CMU_PCLKCR2 Register                                                  */
  __IO uint32_t  PCLKCR3;                           /*!< CMU_PCLKCR3 Register                                                  */
  __IO uint32_t  PCLKCR4;                           /*!< CMU_PCLKCR4 Register                                                  */
  __IO uint32_t  OPCCR1;                            /*!< CMU_OPCCR1 Register                                                   */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  OPCCR3;                            /*!< CMU_OPCCR3 Register                                                   */
  __IO uint32_t  AHBMCR;                            /*!< CMU_AHBMCR Register                                                   */
} CMU_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */


/**
  * @brief COMP module information (COMP)
  */

typedef struct {                                    /*!< COMP Structure                                                        */
  __IO uint32_t  CR;                                /*!< COMP_CR Register                                                      */
} COMP_Type;


/* ================================================================================ */
/* ================                   COMP_COMMON                  ================ */
/* ================================================================================ */


/**
  * @brief COMP_COMMON module information (COMP_COMMON)
  */

typedef struct {                                    /*!< COMP_COMMON Structure                                                 */
  __IO uint32_t  ICR;                               /*!< COMP_COMMON_ICR Register                                              */
  __IO uint32_t  ISR;                               /*!< COMP_COMMON_ISR Register                                              */
  __IO uint32_t  BUFCR;                             /*!< COMP_COMMON_BUFCR Register                                            */
} COMP_COMMON_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */


/**
  * @brief CRC module information (CRC)
  */

typedef struct {                                    /*!< CRC Structure                                                         */
  __IO uint32_t  DR;                                /*!< CRC_DR Register                                                       */
  __IO uint32_t  CR;                                /*!< CRC_CR Register                                                       */
  __IO uint32_t  LFSR;                              /*!< CRC_LFSR Register                                                     */
  __IO uint32_t  XOR;                               /*!< CRC_XOR Register                                                      */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  POLY;                              /*!< CRC_POLY Register                                                     */
} CRC_Type;


/* ================================================================================ */
/* ================                       DBG                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t SYSCON;                            /*!<  Address offset: 0x00 */
  __IO uint32_t CR;                                /*!<  Address offset: 0x04 */
  __IO uint32_t HDFR;                              /*!<  Address offset: 0x08 */
}DBG_Type;



/* ================================================================================ */
/* ================                      DIVAS                     ================ */
/* ================================================================================ */


/**
  * @brief DIVAS module information (DIVAS)
  */

typedef struct {                                    /*!< DIVAS Structure                                                       */
  __IO uint32_t  END;                               /*!< DIVAS_END Register                                                    */
  __IO uint32_t  SOR;                               /*!< DIVAS_SOR Register                                                    */
  __IO uint32_t  QUOT;                              /*!< DIVAS_QUOT Register                                                   */
  __IO uint32_t  REMD;                              /*!< DIVAS_REMD Register                                                   */
  __IO uint32_t  SR;                                /*!< DIVAS_SR Register                                                     */
} DIVAS_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA module information (DMA)
  */

