GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
typedef struct {                                    /*!< DMA Structure                                                         */
  __IO uint32_t  GCR;                               /*!< DMA_GCR Register                                                      */
  __IO uint32_t  CH0CR;                             /*!< DMA_CH0CR Register                                                    */
  __IO uint32_t  CH0MAR;                            /*!< DMA_CH0MAR Register                                                   */
  __IO uint32_t  CH1CR;                             /*!< DMA_CH1CR Register                                                    */
  __IO uint32_t  CH1MAR;                            /*!< DMA_CH1MAR Register                                                   */
  __I  uint32_t  RESERVED[10];
  __IO uint32_t  CH7CR;                             /*!< DMA_CH7CR Register                                                    */
  __IO uint32_t  CH7FLSAD;                          /*!< DMA_CH7FLSAD Register                                                 */
  __IO uint32_t  CH7RAMAD;                          /*!< DMA_CH7RAMAD Register                                                 */
  __IO uint32_t  ISR;                               /*!< DMA_ISR Register                                                      */
  __IO uint32_t  CH0TFSADDR;                        /*!< DMA_CH0TFSADDR Register                                               */
  __IO uint32_t  CH1TFSADDR;                        /*!< DMA_CH1TFSADDR Register                                               */
} DMA_Type;


/* ================================================================================ */
/* ================                       FLS                      ================ */
/* ================================================================================ */


/**
  * @brief FLS module information (FLS)
  */

typedef struct {                                    /*!< FLS Structure                                                         */
  __IO uint32_t  RDCR;                              /*!< FLS_RDCR Register                                                     */
  __IO uint32_t  PFTCON;                            /*!< FLS_PFTCON Register                                                   */
  __IO uint32_t  OPTBR;                             /*!< FLS_OPTBR Register                                                    */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  EPCR;                              /*!< FLS_EPCR Register                                                     */
  __IO uint32_t  KEY;                               /*!< FLS_KEY Register                                                      */
  __IO uint32_t  IER;                               /*!< FLS_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< FLS_ISR Register                                                      */
  __IO uint32_t  ERRIER;                            /*!< FLS_ERRIER Register                                                   */
  __IO uint32_t  ECCSR;                             /*!< FLS_ECCSR Register                                                    */
  __I  uint32_t  RESERVED1[13];
  __IO uint32_t  ACLOCK1;                           /*!< FLS_ACLOCK1 Register                                                  */
} FLASH_Type;


/* ================================================================================ */
/* ================                   GPIO_COMMON                  ================ */
/* ================================================================================ */


/**
  * @brief GPIO_COMMON module information (GPIO_COMMON)
  */

typedef struct {                                    /*!< GPIO_COMMON Structure                                                 */
  __IO uint32_t  EXTISEL0;                          /*!< EXTI_SEL0 Register                                                    */
  __IO uint32_t  EXTISEL1;                          /*!< EXTI_SEL1 Register                                                    */
  __IO uint32_t  EXTIEDS0;                          /*!< EXTI_EDS0 Register                                                    */
  __IO uint32_t  EXTIEDS1;                          /*!< EXTI_EDS1 Register                                                    */
  __IO uint32_t  EXTIDF;                            /*!< EXTI_DF Register                                                      */
  __IO uint32_t  EXTIISR;                           /*!< EXTI_ISR Register                                                     */
  __IO uint32_t  EXTIDI;                            /*!< EXTI_DI Register                                                      */
  __I  uint32_t  RESERVED[9];
  __IO uint32_t  FOUTSEL;                           /*!< FOUTSEL Register                                                      */
  __I  uint32_t  RESERVED1[63];
  __IO uint32_t  PINWKEN;                           /*!< PINWKEN Register                                                      */
} GPIO_COMMON_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */


/**
  * @brief GPIOA module information (GPIO)
  */

typedef struct {                                    /*!< GPIO Structure                                                        */
  __IO uint32_t  INEN;                              /*!< GPIO_INEN Register                                                    */
  __IO uint32_t  PUDEN;                             /*!< GPIO_PUDEN Register                                                   */
  __IO uint32_t  ODEN;                              /*!< GPIO_ODEN Register                                                    */
  __IO uint32_t  FCR;                               /*!< GPIO_FCR Register                                                     */
  __IO uint32_t  DO;                                /*!< GPIO_DO Register                                                      */
  __IO uint32_t  DSET;                              /*!< GPIO_DSET Register                                                    */
  __IO uint32_t  DRST;                              /*!< GPIO_DRST Register                                                    */
  __IO uint32_t  DIN;                               /*!< GPIO_DIN Register                                                     */
  __IO uint32_t  DFS;                               /*!< GPIO_DFS Register                                                     */
  __IO uint32_t  SRDR;                              /*!< GPIO_SRDR Register                                                    */
  __IO uint32_t  RESERVED[2];                       /*!<  RESERVED REGISTER,,                                                  */
  __IO uint32_t TMUXR;                              /*!<  GPIOC Timer Mux Register,                                            */
} GPIO_Type;


/* ================================================================================ */
/* ================                   GPIOC_TMUX                   ================ */
/* ================================================================================ */





/* ================================================================================ */
/* ================                      GPTIM                     ================ */
/* ================================================================================ */


/**
  * @brief GPTIM module information (GPTIM)
  */

typedef struct {                                    /*!< GPTIM Structure                                                       */
  __IO uint32_t  CR1;                               /*!< GPTIM_CR1 Register                                                    */
  __IO uint32_t  CR2;                               /*!< GPTIM_CR2 Register                                                    */
  __IO uint32_t  SMCR;                              /*!< GPTIM_SMCR Register                                                   */
  __IO uint32_t  DIER;                              /*!< GPTIM_DIER Register                                                   */
  __IO uint32_t  ISR;                               /*!< GPTIM_ISR Register                                                    */
  __IO uint32_t  EGR;                               /*!< GPTIM_EGR Register                                                    */
  __IO uint32_t  CCMR1;                             /*!< GPTIM_CCMR1 Register                                                  */
  __IO uint32_t  CCMR2;                             /*!< GPTIM_CCMR2 Register                                                  */
  __IO uint32_t  CCER;                              /*!< GPTIM_CCER Register                                                   */
  __IO uint32_t  CNT;                               /*!< GPTIM_CNT Register                                                    */
  __IO uint32_t  PSC;                               /*!< GPTIM_PSC Register                                                    */
  __IO uint32_t  ARR;                               /*!< GPTIM_ARR Register                                                    */
  __I  uint32_t  RESERVED;
  __IO uint32_t  CCR1;                              /*!< GPTIM_CCR1 Register                                                   */
  __IO uint32_t  CCR2;                              /*!< GPTIM_CCR2 Register                                                   */
  __IO uint32_t  CCR3;                              /*!< GPTIM_CCR3 Register                                                   */
  __IO uint32_t  CCR4;                              /*!< GPTIM_CCR4 Register                                                   */
  __I  uint32_t  RESERVED1[4];
  __IO uint32_t  ECR;                               /*!< GPTIM_ECR Register                                                    */
  __IO uint32_t  TISEL;                             /*!< GPTIM_TISEL Register                                                  */
  __IO uint32_t  AFR;                               /*!< GPTIM_AFR Register                                                    */
  __I  uint32_t  RESERVED2[38];
} GPTIM_Type;


/* ================================================================================ */
/* ================                       I2C                      ================ */
/* ================================================================================ */


/**
  * @brief I2C0 module information (I2C)
  */

typedef struct {                                    /*!< I2C Structure                                                         */
  __IO uint32_t  MSPCFGR;                           /*!< I2C_MSPCFGR Register                                                  */
  __IO uint32_t  MSPCR;                             /*!< I2C_MSPCR Register                                                    */
  __IO uint32_t  MSPIER;                            /*!< I2C_MSPIER Register                                                   */
  __IO uint32_t  MSPISR;                            /*!< I2C_MSPISR Register                                                   */
  __IO uint32_t  MSPSR;                             /*!< I2C_MSPSR Register                                                    */
  __IO uint32_t  MSPBGR;                            /*!< I2C_MSPBGR Register                                                   */
  __IO uint32_t  MSPBUF;                            /*!< I2C_MSPBUF Register                                                   */
  __IO uint32_t  MSPTCR;                            /*!< I2C_MSPTCR Register                                                   */
  __IO uint32_t  MSPTOR;                            /*!< I2C_MSPTOR Register                                                   */
} I2C_Type;


/* ================================================================================ */
/* ================                     INTMUX                     ================ */
/* ================================================================================ */


/**
  * @brief INTMUX module information (INTMUX)
  */

typedef struct {                                    /*!< INTMUX Structure                                                      */
  __IO uint32_t  CR;                                /*!< INTMUX_CR Register                                                    */
} INTMUX_Type;


/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */


/**
  * @brief IWDT module information (IWDT)
  */

typedef struct {                                    /*!< IWDT Structure                                                        */
  __IO uint32_t  SERV;                              /*!< IWDT_SERV Register                                                    */
  __IO uint32_t  CR;                                /*!< IWDT_CR Register                                                      */
  __IO uint32_t  CNT;                               /*!< IWDT_CNT Register                                                     */
  __IO uint32_t  WIN;                               /*!< IWDT_WIN Register                                                     */
  __IO uint32_t  IER;                               /*!< IWDT_IER Register                                                     */
  __IO uint32_t  ISR;                               /*!< IWDT_ISR Register                                                     */
} IWDT_Type;


/* ================================================================================ */
/* ================                     LPTIM16                    ================ */
/* ================================================================================ */


/**
  * @brief LPTIM16 module information (LPTIM16)
  */

typedef struct {                                    /*!< LPTIM16 Structure                                                     */
  __IO uint32_t  CFGR;                              /*!< LPTIM16_CFGR Register                                                 */
  __IO uint32_t  CNT;                               /*!< LPTIM16_CNT Register                                                  */
  __IO uint32_t  CCSR;                              /*!< LPTIM16_CCSR Register                                                 */
  __IO uint32_t  ARR;                               /*!< LPTIM16_ARR Register                                                  */
  __IO uint32_t  IER;                               /*!< LPTIM16_IER Register                                                  */
  __IO uint32_t  ISR;                               /*!< LPTIM16_ISR Register                                                  */
  __IO uint32_t  CR;                                /*!< LPTIM16_CR Register                                                   */
  __I  uint32_t  RESERVED;
  __IO uint32_t  CCR1;                              /*!< LPTIM16_CCR1 Register                                                 */
  __IO uint32_t  CCR2;                              /*!< LPTIM16_CCR2 Register                                                 */
} LPTIM16_Type;


/* ================================================================================ */
/* ================                       PGL                      ================ */
/* ================================================================================ */


/**
  * @brief PGL module information (PGL)
  */

