GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
typedef struct {                                    /*!< PGL Structure                                                         */
  __IO uint32_t  CR;                                /*!< PGL_CR Register                                                       */
  __IO uint32_t  CFGR0;                             /*!< PGL_CFGR0 Register                                                    */
  __IO uint32_t  CFGR1;                             /*!< PGL_CFGR1 Register                                                    */
  __IO uint32_t  CFGR2;                             /*!< PGL_CFGR2 Register                                                    */
  __IO uint32_t  CFGR3;                             /*!< PGL_CFGR3 Register                                                    */
  __IO uint32_t  IER;                               /*!< PGL_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< PGL_ISR Register                                                      */
  __IO uint32_t  LUT0;                              /*!< PGL_LUT0 Register                                                     */
  __IO uint32_t  LUT1;                              /*!< PGL_LUT1 Register                                                     */
  __IO uint32_t  LUT2;                              /*!< PGL_LUT2 Register                                                     */
  __IO uint32_t  LUT3;                              /*!< PGL_LUT3 Register                                                     */
} PGL_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief PMU module information (PMU)
  */

typedef struct {                                    /*!< PMU Structure                                                         */
  __IO uint32_t  CR;                                /*!< PMU_CR Register                                                       */
  __IO uint32_t  WKTR;                              /*!< PMU_WKTR Register                                                     */
  __IO uint32_t  WKFR;                              /*!< PMU_WKFR Register                                                     */
  __IO uint32_t  IER;                               /*!< PMU_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< PMU_ISR Register                                                      */
  __I  uint32_t  RESERVED[10];
  __IO uint32_t  BUFCR;                             /*!< PMU_BUFCR Register                                                    */
  __I  uint32_t  RESERVED1[4];
  __IO uint32_t  PTATCR;                            /*!< PMU_PTAT_CR Register                                                  */
} PMU_Type;





/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */


/**
  * @brief RMU module information (RMU)
  */

typedef struct {                                    /*!< RMU Structure                                                         */
  __I  uint32_t  RESERVED;
  __IO uint32_t  BORCR;                             /*!< RMU_BORCR Register                                                    */
  __IO uint32_t  LKPCR;                             /*!< RMU_LKPCR Register                                                    */
  __IO uint32_t  SOFTRST;                           /*!< RMU_SOFTRST Register                                                  */
  __IO uint32_t  RSTFR;                             /*!< RMU_RSTFR Register                                                    */
  __IO uint32_t  PRSTEN;                            /*!< RMU_PRSTEN Register                                                   */
  __IO uint32_t  AHBRSTCR;                          /*!< RMU_AHBRSTCR Register                                                 */
  __IO uint32_t  APBRSTCR1;                         /*!< RMU_APBRSTCR1 Register                                                */
  __IO uint32_t  APBRSTCR2;                         /*!< RMU_APBRSTCR2 Register                                                */
} RMU_Type;




/* ================================================================================ */
/* ================                       SFU                      ================ */
/* ================================================================================ */


/**
  * @brief SFU module information (SFU)
  */

typedef struct {                                    /*!< SFU Structure                                                         */
  __IO uint32_t  RAMPCR;                            /*!< SFU_RAMP_CR Register                                                  */
  __IO uint32_t  RAMPSR;                            /*!< SFU_RAMP_SR Register                                                  */
  __IO uint32_t  MAPCR;                             /*!< SFU_MAP_CR Register                                                   */
  __IO uint32_t  MAPSR;                             /*!< SFU_MAP_SR Register                                                   */
  __IO uint32_t  BKR;                               /*!< SFU_BKR Register                                                      */
} SFU_Type;


/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */


/**
  * @brief SPI0 module information (SPI)
  */

typedef struct {                                    /*!< SPI Structure                                                         */
  __IO uint32_t  CR1;                               /*!< SPI_CR1 Register                                                      */
  __IO uint32_t  CR2;                               /*!< SPI_CR2 Register                                                      */
  __IO uint32_t  CR3;                               /*!< SPI_CR3 Register                                                      */
  __IO uint32_t  IER;                               /*!< SPI_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< SPI_ISR Register                                                      */
  __IO uint32_t  TXBUF;                             /*!< SPI_TXBUF Register                                                    */
  __IO uint32_t  RXBUF;                             /*!< SPI_RXBUF Register                                                    */
} SPI_Type;


/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */


/**
  * @brief SVD module information (SVD)
  */

