GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
typedef struct {                                    /*!< SVD Structure                                                         */
  __IO uint32_t  CFGR;                              /*!< SVD_CFGR Register                                                     */
  __IO uint32_t  CR;                                /*!< SVD_CR Register                                                       */
  __IO uint32_t  IER;                               /*!< SVD_IER Register                                                      */
  __IO uint32_t  ISR;                               /*!< SVD_ISR Register                                                      */
  __IO uint32_t  VSR;                               /*!< SVD_VSR Register                                                      */
} SVD_Type;


/* ================================================================================ */
/* ================                      TAU0                      ================ */
/* ================================================================================ */


/**
  * @brief TAU0 module information (TAU0)
  */

typedef struct {                                    /*!< TAU0 Structure                                                        */
  __IO uint32_t  T0CFGR;                            /*!< TAU0_T0CFGR Register                                                  */
  __IO uint32_t  T1CFGR;                            /*!< TAU0_T1CFGR Register                                                  */
  __IO uint32_t  T2CFGR;                            /*!< TAU0_T2CFGR Register                                                  */
  __IO uint32_t  T3CFGR;                            /*!< TAU0_T3CFGR Register                                                  */
  __IO uint32_t  T4CFGR;                            /*!< TAU0_T4CFGR Register                                                  */
  __IO uint32_t  T5CFGR;                            /*!< TAU0_T5CFGR Register                                                  */
  __IO uint32_t  T6CFGR;                            /*!< TAU0_T6CFGR Register                                                  */
  __IO uint32_t  T7CFGR;                            /*!< TAU0_T7CFGR Register                                                  */
  __IO uint32_t  T0MDR;                             /*!< TAU0_T0MDR Register                                                   */
  __IO uint32_t  T1MDR;                             /*!< TAU0_T1MDR Register                                                   */
  __IO uint32_t  T2MDR;                             /*!< TAU0_T2MDR Register                                                   */
  __IO uint32_t  T3MDR;                             /*!< TAU0_T3MDR Register                                                   */
  __IO uint32_t  T4MDR;                             /*!< TAU0_T4MDR Register                                                   */
  __IO uint32_t  T5MDR;                             /*!< TAU0_T5MDR Register                                                   */
  __IO uint32_t  T6MDR;                             /*!< TAU0_T6MDR Register                                                   */
  __IO uint32_t  T7MDR;                             /*!< TAU0_T7MDR Register                                                   */
  __IO uint32_t  T0ARR;                             /*!< TAU0_T0ARR Register                                                   */
  __IO uint32_t  T1ARR;                             /*!< TAU0_T1ARR Register                                                   */
  __IO uint32_t  T2ARR;                             /*!< TAU0_T2ARR Register                                                   */
  __IO uint32_t  T3ARR;                             /*!< TAU0_T3ARR Register                                                   */
  __IO uint32_t  T4ARR;                             /*!< TAU0_T4ARR Register                                                   */
  __IO uint32_t  T5ARR;                             /*!< TAU0_T5ARR Register                                                   */
  __IO uint32_t  T6ARR;                             /*!< TAU0_T6ARR Register                                                   */
  __IO uint32_t  T7ARR;                             /*!< TAU0_T7ARR Register                                                   */
  __IO uint32_t  T0CCR;                             /*!< TAU0_T0CCR Register                                                   */
  __IO uint32_t  T1CCR;                             /*!< TAU0_T1CCR Register                                                   */
  __IO uint32_t  T2CCR;                             /*!< TAU0_T2CCR Register                                                   */
  __IO uint32_t  T3CCR;                             /*!< TAU0_T3CCR Register                                                   */
  __IO uint32_t  T4CCR;                             /*!< TAU0_T4CCR Register                                                   */
  __IO uint32_t  T5CCR;                             /*!< TAU0_T5CCR Register                                                   */
  __IO uint32_t  T6CCR;                             /*!< TAU0_T6CCR Register                                                   */
  __IO uint32_t  T7CCR;                             /*!< TAU0_T7CCR Register                                                   */
  __IO uint32_t  T0IER;                             /*!< TAU0_T0IER Register                                                   */
  __IO uint32_t  T1IER;                             /*!< TAU0_T1IER Register                                                   */
  __IO uint32_t  T2IER;                             /*!< TAU0_T2IER Register                                                   */
  __IO uint32_t  T3IER;                             /*!< TAU0_T3IER Register                                                   */
  __IO uint32_t  T4IER;                             /*!< TAU0_T4IER Register                                                   */
  __IO uint32_t  T5IER;                             /*!< TAU0_T5IER Register                                                   */
  __IO uint32_t  T6IER;                             /*!< TAU0_T6IER Register                                                   */
  __IO uint32_t  T7IER;                             /*!< TAU0_T7IER Register                                                   */
  __IO uint32_t  T0ISR;                             /*!< TAU0_T0ISR Register                                                   */
  __IO uint32_t  T1ISR;                             /*!< TAU0_T1ISR Register                                                   */
  __IO uint32_t  T2ISR;                             /*!< TAU0_T2ISR Register                                                   */
  __IO uint32_t  T3ISR;                             /*!< TAU0_T3ISR Register                                                   */
  __IO uint32_t  T4ISR;                             /*!< TAU0_T4ISR Register                                                   */
  __IO uint32_t  T5ISR;                             /*!< TAU0_T5ISR Register                                                   */
  __IO uint32_t  T6ISR;                             /*!< TAU0_T6ISR Register                                                   */
  __IO uint32_t  T7ISR;                             /*!< TAU0_T7ISR Register                                                   */
  __IO uint32_t  T0CNTR;                            /*!< TAU0_T0CNTR Register                                                  */
  __IO uint32_t  T1CNTR;                            /*!< TAU0_T1CNTR Register                                                  */
  __IO uint32_t  T2CNTR;                            /*!< TAU0_T2CNTR Register                                                  */
  __IO uint32_t  T3CNTR;                            /*!< TAU0_T3CNTR Register                                                  */
  __IO uint32_t  T4CNTR;                            /*!< TAU0_T4CNTR Register                                                  */
  __IO uint32_t  T5CNTR;                            /*!< TAU0_T5CNTR Register                                                  */
  __IO uint32_t  T6CNTR;                            /*!< TAU0_T6CNTR Register                                                  */
  __IO uint32_t  T7CNTR;                            /*!< TAU0_T7CNTR Register                                                  */
} TAU0_Type;


/* ================================================================================ */
/* ================                      TAU1                      ================ */
/* ================================================================================ */


/**
  * @brief TAU1 module information (TAU1)
  */

typedef struct {                                    /*!< TAU1 Structure                                                        */
  __IO uint32_t  T0CFGR;                            /*!< TAU1_T0CFGR Register                                                  */
  __IO uint32_t  T1CFGR;                            /*!< TAU1_T1CFGR Register                                                  */
  __IO uint32_t  T2CFGR;                            /*!< TAU1_T2CFGR Register                                                  */
  __IO uint32_t  T3CFGR;                            /*!< TAU1_T3CFGR Register                                                  */
  __IO uint32_t  T0MDR;                             /*!< TAU1_T0MDR Register                                                   */
  __IO uint32_t  T1MDR;                             /*!< TAU1_T1MDR Register                                                   */
  __IO uint32_t  T2MDR;                             /*!< TAU1_T2MDR Register                                                   */
  __IO uint32_t  T3MDR;                             /*!< TAU1_T3MDR Register                                                   */
  __IO uint32_t  T0ARR;                             /*!< TAU1_T0ARR Register                                                   */
  __IO uint32_t  T1ARR;                             /*!< TAU1_T1ARR Register                                                   */
  __IO uint32_t  T2ARR;                             /*!< TAU1_T2ARR Register                                                   */
  __IO uint32_t  T3ARR;                             /*!< TAU1_T3ARR Register                                                   */
  __IO uint32_t  T0CCR;                             /*!< TAU1_T0CCR Register                                                   */
  __IO uint32_t  T1CCR;                             /*!< TAU1_T1CCR Register                                                   */
  __IO uint32_t  T2CCR;                             /*!< TAU1_T2CCR Register                                                   */
  __IO uint32_t  T3CCR;                             /*!< TAU1_T3CCR Register                                                   */
  __IO uint32_t  T0IER;                             /*!< TAU1_T0IER Register                                                   */
  __IO uint32_t  T1IER;                             /*!< TAU1_T1IER Register                                                   */
  __IO uint32_t  T2IER;                             /*!< TAU1_T2IER Register                                                   */
  __IO uint32_t  T3IER;                             /*!< TAU1_T3IER Register                                                   */
  __IO uint32_t  T0ISR;                             /*!< TAU1_T0ISR Register                                                   */
  __IO uint32_t  T1ISR;                             /*!< TAU1_T1ISR Register                                                   */
  __IO uint32_t  T2ISR;                             /*!< TAU1_T2ISR Register                                                   */
  __IO uint32_t  T3ISR;                             /*!< TAU1_T3ISR Register                                                   */
  __IO uint32_t  T0CNTR;                            /*!< TAU1_T0CNTR Register                                                  */
  __IO uint32_t  T1CNTR;                            /*!< TAU1_T1CNTR Register                                                  */
  __IO uint32_t  T2CNTR;                            /*!< TAU1_T2CNTR Register                                                  */
  __IO uint32_t  T3CNTR;                            /*!< TAU1_T3CNTR Register                                                  */
} TAU1_Type;


/* ================================================================================ */
/* ================                   TAU_COMMON                   ================ */
/* ================================================================================ */


/**
  * @brief TAU_COMMON module information (TAU_COMMON)
  */

typedef struct {                                    /*!< TAU_COMMON Structure                                                  */
  __IO uint32_t  TAU0CR;                            /*!< TAU0_CR Register                                                      */
  __IO uint32_t  TAU1CR;                            /*!< TAU1_CR Register                                                      */
  __IO uint32_t  TAU0EGR;                           /*!< TAU0_EGR Register                                                     */
  __IO uint32_t  TAU1EGR;                           /*!< TAU1_EGR Register                                                     */
} TAU_COMMON_Type;


/* ================================================================================ */
/* ================                      UARTL                     ================ */
/* ================================================================================ */


/**
  * @brief UART module information (UART)
  */

typedef struct {                                    /*!< UARTL Structure                                                       */
  __IO uint32_t  CSR;                               /*!< UARTL_CSR Register                                                    */
  __IO uint32_t  IER;                               /*!< UARTL_IER Register                                                    */
  __IO uint32_t  ISR;                               /*!< UARTL_ISR Register                                                    */
  __IO uint32_t  TODR;                              /*!< UARTL_TODR Register                                                   */
  __IO uint32_t  RXBUF;                             /*!< UARTL_RXBUF Register                                                  */
  __IO uint32_t  TXBUF;                             /*!< UARTL_TXBUF Register                                                  */
  __IO uint32_t  BGR;                               /*!< UARTL_BGR Register                                                    */
  __I  uint32_t  RESERVED;
  __IO uint32_t  MCR;                               /*!< UARTL_MCR Register                                                    */
  __IO uint32_t  LINCR;                             /*!< UARTL_LINCR Register                                                  */
  __IO uint32_t  LINBSR;                            /*!< UARTL_LINBSR Register                                                 */
  __IO uint32_t  LINFTR;                            /*!< UARTL_LINFTR Register                                                 */
  __IO uint32_t  LINTTR;                            /*!< UARTL_LINTTR Register                                                 */
  __IO uint32_t  LINPSR;                            /*!< UARTL_LINPSR Register                                                 */
  __IO uint32_t  LINBKR;                            /*!< UARTL_LINBKR Register                                                 */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SCISR;                             /*!< USART_SCISR Register                                                  */
  __IO uint32_t  SCIER;                             /*!< USART_SCIER Register                                                  */
  __IO uint32_t  FFCR;                              /*!< USART_FFCR Register                                                   */
  __IO uint32_t  EGTR;                              /*!< USART_EGTR Register                                                   */
  __IO uint32_t  CODR;                              /*!< USART_CODR Register                                                   */
} UART_Type;


/* ================================================================================ */
/* ================                   UART_COMMON                  ================ */
/* ================================================================================ */


/**
  * @brief UART_COMMON module information (UART_COMMON)
  */

typedef struct {                                    /*!< UART_COMMON Structure                                                 */
  __IO uint32_t  IRCR;                              /*!< UART_COMMON_IRCR Register                                             */
} UART_COMMON_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief WWDT module information (WWDT)
  */

typedef struct {                                    /*!< WWDT Structure                                                        */
  __IO uint32_t  CR;                                /*!< WWDT_CR Register                                                      */
  __IO uint32_t  CFGR;                              /*!< WWDT_CFGR Register                                                    */
  __IO uint32_t  CNT;                               /*!< WWDT_CNT Register                                                     */
  __IO uint32_t  IER;                               /*!< WWDT_IER Register                                                     */
  __IO uint32_t  ISR;                               /*!< WWDT_ISR Register                                                     */
  __IO uint32_t  PSC;                               /*!< WWDT_PSC Register                                                     */
} WWDT_Type;





/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ADC_BASE                        0x4001AC00UL
#define ATIM_BASE                       0x4001B000UL
#define BSTIM16_BASE                    0x4001B400UL
#define CMU_BASE                        0x40002400UL
#define COMP1_BASE                      0x40019C00UL
#define COMPCOMMON_BASE                 0x40019C0CUL
#define CRC_BASE                        0x40018000UL
#define DBG_BASE                        0x40000000UL
#define DIVAS_BASE                      0x40013000UL
#define DMA_BASE                        0x40000400UL
#define FLASH_BASE                      0x40001000UL
#define GPIOCOMMON_BASE                 0x40000DC0UL
#define GPIOA_BASE                      0x40000C00UL
#define GPIOB_BASE                      0x40000C40UL
#define GPIOC_BASE                      0x40000C80UL
#define GPIOD_BASE                      0x40000CC0UL
#define GPIOE_BASE                      0x40000D00UL
#define GPTIM_BASE                      0x40014C00UL
#define I2C0_BASE                       0x40015000UL
#define I2C1_BASE                       0x40015400UL
#define INTMUX_BASE                     0x40016000UL
#define IWDT_BASE                       0x40011400UL
#define LPTIM16_BASE                    0x40013400UL
#define PGL_BASE                        0x40013800UL
#define PMU_BASE                        0x40002000UL
#define RMU_BASE                        0x40002800UL
#define SFU_BASE                        0x40001C00UL
#define SPI0_BASE                       0x40019000UL
#define SPI1_BASE                       0x40018C00UL
#define SVD_BASE                        0x4001A800UL
#define TAU0_BASE                       0x40013C10UL
#define TAU1_BASE                       0x40013CF0UL
#define TAUCOMMON_BASE                  0x40013C00UL
#define UART1_BASE                      0x40012000UL
#define UART2_BASE                      0x40017400UL
#define UART4_BASE                      0x4001A000UL
#define UART5_BASE                      0x4001A400UL
#define UARTCOMMON_BASE                 0x40017C00UL
#define WWDT_BASE                       0x40011800UL


