GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33lr0xx.h
/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */
#define ADC                             ((ADC_Type          *) ADC_BASE         )
#define ATIM                            ((ATIM_Type         *) ATIM_BASE        )
#define BSTIM16                         ((BSTIM16_Type      *) BSTIM16_BASE     )
#define CMU                             ((CMU_Type          *) CMU_BASE         )
#define COMP1                           ((COMP_Type         *) COMP1_BASE       )
#define COMP                            ((COMP_COMMON_Type  *) COMPCOMMON_BASE  )
#define CRC                             ((CRC_Type          *) CRC_BASE         )
#define DBG                             ((DBG_Type          *) DBG_BASE         )
#define DIVAS                           ((DIVAS_Type        *) DIVAS_BASE       )
#define DMA                             ((DMA_Type          *) DMA_BASE         )
#define FLASH                           ((FLASH_Type        *) FLASH_BASE       )
#define GPIO                            ((GPIO_COMMON_Type  *) GPIOCOMMON_BASE  )
#define GPIOA                           ((GPIO_Type         *) GPIOA_BASE       )
#define GPIOB                           ((GPIO_Type         *) GPIOB_BASE       )
#define GPIOC                           ((GPIO_Type         *) GPIOC_BASE       )
#define GPIOD                           ((GPIO_Type         *) GPIOD_BASE       )
#define GPIOE                           ((GPIO_Type         *) GPIOE_BASE       )
#define GPTIM                           ((GPTIM_Type        *) GPTIM_BASE       )
#define I2C0                            ((I2C_Type          *) I2C0_BASE        )
#define I2C1                            ((I2C_Type          *) I2C1_BASE        )
#define INTMUX                          ((INTMUX_Type       *) INTMUX_BASE      )
#define IWDT                            ((IWDT_Type         *) IWDT_BASE        )
#define LPTIM16                         ((LPTIM16_Type      *) LPTIM16_BASE     )
#define PGL                             ((PGL_Type          *) PGL_BASE         )
#define PMU                             ((PMU_Type          *) PMU_BASE         )
#define RMU                             ((RMU_Type          *) RMU_BASE         )
#define SFU                             ((SFU_Type          *) SFU_BASE         )
#define SPI0                            ((SPI_Type          *) SPI0_BASE        )
#define SPI1                            ((SPI_Type          *) SPI1_BASE        )
#define SVD                             ((SVD_Type          *) SVD_BASE         )
#define TAU0                            ((TAU0_Type         *) TAU0_BASE        )
#define TAU1                            ((TAU1_Type         *) TAU1_BASE        )
#define TAU                             ((TAU_COMMON_Type   *) TAUCOMMON_BASE   )
#define UART1                           ((UART_Type         *) UART1_BASE       )
#define UART2                           ((UART_Type         *) UART2_BASE       )
#define UART4                           ((UART_Type         *) UART4_BASE       )
#define UART5                           ((UART_Type         *) UART5_BASE       )
#define UART                            ((UART_COMMON_Type  *) UARTCOMMON_BASE )
#define WWDT                            ((WWDT_Type         *) WWDT_BASE        )


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33LR0XX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33LR0XX_H */

